// C# поддерживает все пять принципов повторного использования модулей:
// 1. Допускается параметризация другими типами (генерики);
// 2. Несколько функций могут быть объединены (например в рамках нового класса);
// 3. Новый модуль может входить в семейство модулей благодаря пространству имен или references;
// 4. Новый модуль может предлагать конкретную реализацию родительского модуля через наследование и закрытие генериков;
// 5. Новый модуль может интегрировать общее поведение нескольких модулей через пространство имен или references;

